<!-- dflook/terraform-github-actions {"workspace":"cloud-json-plan-2","backend":"2f3483b3419e2c7376a6ea192a9774c62e6ce92a83a0bba53faefd46598b4094","backend_type":"remote"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __cloud-json-plan-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables="from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #19](https://github.com/dflook/terraform-github-actions/actions/runs/2282000216)